;<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
include \masm32\include\masm32rt.inc
;<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
.data

;определение байта
vldb db ?            ; Не инициализированно
v2db db 'Рогов'      ; Строка
v3db db 56           ; Десятичная константа
v4db db 04fh         ; Шестнадцатиричная константа
v5db db 0110100b     ; Двоичная константа
v6db db 1, 'dat', 'name', 42 ; таблица
v7db db 8 dup(0)     ; Восемь нулей

;определение слова
v4dw dw 24,5,7       ; 3 константы через запятую

;определение двойного слова
vldd dd ?            ; Не определено
v2dd dd 'FAdf'       ; Символьная строка
v3dd dd 08234        ; Десятичная константа
v5dd dd 017h, 05fh   ; Две константы

; Определение учетверенного слова
vldq dq ? ; Не определено
d1 equ 25
d2 = v3db

.code
start:
;<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
main proc
    fn MessageBox,0,"Рогов В.В.","Задание памяти",MB_OK
    invoke ExitProcess, 0
main endp
;<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
end start